item_cart/app/controllers/api/v1/items_controller.rb

  def index
    respond_with Item.all
---
SELECT "items".* FROM "items"